# ElementSet Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementSet Constructor
ElementSet Class See Also
---
Initializes a new instance of the ElementSet class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementSet()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ElementSet()
```

# See Also
ElementSet Class
Autodesk.Revit.DB Namespace